# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P2–P5 outputs using GLSA modules.
# For usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]
head_channel: 256

# ===========================
# Backbone
# ===========================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]       # 9
  - [-1, 2, C2PSA, [1024]]         # 10

# ===========================
# Head (GLSA + P2)
# ===========================
head:
  - [4, 1, GLSA, [512]]            # 11-P3/8
  - [6, 1, GLSA, [512]]            # 12-P4/16
  - [10, 1, GLSA, [1024]]          # 13-P5/32

  # ---- Top-down path ----
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14 P5->P4
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]                  # 16-P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 17 P4->P3
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]                  # 19-P3/8-small

  # ---- Add P2 branch ----
  - [1, 1, Conv, [128, 3, 1]]                   # 20 P2-base
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # optional refine upsample
  - [[-1, 19], 1, Concat, [1]]                  # 22 fuse P2 with P3
  - [-1, 2, C3k2, [128, False]]                 # 23-P2/4-xsmall

  # ---- Bottom-up ----
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 19], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]                 # 26-P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]                 # 29-P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]                 # 32-P5/32

  # ---- Detect ----
  - [[23, 26, 29, 32], 1, Detect, [nc]]         # Detect(P2, P3, P4, P5)
