# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P2–P5 outputs using BiFPN.
# For usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]
fusion_mode: bifpn
node_mode: C3k2
head_channel: 256

# ===========================
# Backbone
# ===========================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]       # 9
  - [-1, 2, C2PSA, [1024]]         # 10

# ===========================
# Head (BiFPN + P2)
# ===========================
head:
  - [4, 1, Conv, [head_channel]]    # 11-P3/8
  - [6, 1, Conv, [head_channel]]    # 12-P4/16
  - [10, 1, Conv, [head_channel]]   # 13-P5/32

  # ---- BiFPN top-down ----
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14 P5->P4
  - [[-1, 12], 1, Fusion, [fusion_mode]]        # 15
  - [-1, 3, node_mode, [head_channel, False]]   # 16-P4/16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 17 P4->P3
  - [[-1, 11], 1, Fusion, [fusion_mode]]        # 18
  - [-1, 3, node_mode, [head_channel, False]]   # 19-P3/8

  # ---- Add P2 branch ----
  - [1, 1, Conv, [head_channel, 3, 1]]          # 20 P2-base
  - [[-1, 19], 1, Fusion, [fusion_mode]]        # 21
  - [-1, 3, node_mode, [head_channel, False]]   # 22-P2/4

  # ---- Bottom-up ----
  - [-1, 1, Conv, [head_channel, 3, 2]]         # 23 P2->P3
  - [[-1, 11, 19], 1, Fusion, [fusion_mode]]    # 24
  - [-1, 3, node_mode, [head_channel, False]]   # 25-P3/8

  - [-1, 1, Conv, [head_channel, 3, 2]]         # 26 P3->P4
  - [[-1, 12, 16], 1, Fusion, [fusion_mode]]    # 27
  - [-1, 3, node_mode, [head_channel, False]]   # 28-P4/16

  - [-1, 1, Conv, [head_channel, 3, 2]]         # 29 P4->P5
  - [[-1, 13], 1, Fusion, [fusion_mode]]        # 30
  - [-1, 3, node_mode, [head_channel, False]]   # 31-P5/32

  # ---- Detect ----
  - [[22, 25, 28, 31], 1, Detect, [nc]]         # Detect(P2, P3, P4, P5)
