nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]
fusion_mode: bifpn
node_mode: C3k2
head_channel: 256

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, LAWDS, []]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, LAWDS, []]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, LAWDS, []]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [4, 1, Conv, [head_channel]]
  - [6, 1, Conv, [head_channel]]
  - [10, 1, Conv, [head_channel]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 12], 1, Fusion, [fusion_mode]]
  - [-1, 3, node_mode, [head_channel, False]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 11], 1, Fusion, [fusion_mode]]
  - [-1, 3, node_mode, [head_channel, False]]
  - [2, 1, Conv, [head_channel, 3, 2]]
  - [[-1, 11, 19], 1, Fusion, [fusion_mode]]
  - [-1, 3, node_mode, [head_channel, False]]
  - [-1, 1, Conv, [head_channel, 3, 2]]
  - [[-1, 12, 16], 1, Fusion, [fusion_mode]]
  - [-1, 3, node_mode, [head_channel, False]]
  - [-1, 1, Conv, [head_channel, 3, 2]]
  - [[-1, 13], 1, Fusion, [fusion_mode]]
  - [-1, 3, node_mode, [head_channel, False]]
  - [[22, 25, 28], 1, Detect, [nc]]

